{
    "DialogShowWheel": 0b,
    "AvailabilityQuestId": -1,
    "Options": [
    ],
    "DialogHideNPC": 0b,
    "AvailabilityFactionStance": 0,
    "AvailabilityQuest": 0,
    "AvailabilityDialog4": 0,
    "AvailabilityDialog3": 0,
    "AvailabilityQuest2": 0,
    "AvailabilityQuest3": 0,
    "AvailabilityQuest4": 0,
    "ModRev": 16,
    "DecreaseFaction1Points": 0b,
    "DialogQuest": -1,
    "AvailabilityDialog2": 0,
    "OptionFactions1": -1,
    "AvailabilityDayTime": 0,
    "OptionFactions2": -1,
    "AvailabilityFaction2Id": -1,
    "OptionFaction1Points": 100,
    "DialogDisableEsc": 0b,
    "AvailabilityFaction": 0,
    "DialogTitle": "Reactor Theory",
    "AvailabilityDialog": 0,
    "AvailabilityFaction2": 0,
    "AvailabilityFactionId": -1,
    "AvailabilityFaction2Stance": 0,
    "DialogCommand": "",
    "AvailabilityDialogId": -1,
    "OptionFaction2Points": 100,
    "DialogText": "Ohhh boy. Reactor theory! I love this stuff! But... I think you'll die of boredom before I finish explaining. Or it might be radiation poisioning. Same thing, right?So the fundamental rules are that you need a full-encased structure with reactor casing. You can put *reactor* glass anywhere but any corners. You need a control, a fuel port, and well, a power tap. Right? A power tap! Do you know how many get halfway into building the thing and realize, \"Whoops!\"Inside you're going to need at least one column of fuel rods, with a control rod on top flush with the casing.So here the fun begins. There are all kinds of materials you can use to cool a reactor. Interesting enough though, NOT water. I know! Well, you can pour it in, but it's going to make things worse. You can actually use blocks of graphite or iron, but ... meh. Don't bother with that crap. Even electrum is tedious for how many blocks you'd make. I'd start with destabilized redstone. That's good stuff. Here's a trick: you only have to pour it up on top. You don't have to lay it up in layers or anything. It'll run down and count for all the layers below.There's a little game to play with the fuel rods too. Generally, cooling only helps in the cardinal directions... you know, the non-diagonal ones. So if you have one fuel rod in the middle of a giant reactor, you only need to put cooling along the ceiling blocks north, south, east, and west of it. Putting any off to the sides beyond that doesn't do you any good.Resonant ender is better than destabilized redstone, but that's assuming you have a pile of ender pearls. Beyond that is gelid cryotheum, which is so cold it can produce snow on top of the reactor while it's running. If you're getting to that point, it's about time you went for turbines for cooling.",
    "AvailabilityQuest4Id": -1,
    "AvailabilityQuest3Id": -1,
    "AvailabilityQuest2Id": -1,
    "AvailabilityDialog2Id": -1,
    "AvailabilityDialog3Id": -1,
    "AvailabilityDialog4Id": -1,
    "AvailabilityMinPlayerLevel": 0,
    "DecreaseFaction2Points": 0b,
    "DialogMail": {
        "Sender": "",
        "BeenRead": 0b,
        "Message": {
        },
        "MailItems": [
        ],
        "MailQuest": -1,
        "TimePast": 1464244818860L,
        "Time": 0L,
        "Subject": ""
    }
}
