{
    "AvailabilityQuest4": 0,
    "DecreaseFaction1Points": 0b,
    "AvailabilityQuest3": 0,
    "AvailabilityFactionId": -1,
    "AvailabilityMinPlayerLevel": 0,
    "AvailabilityQuest3Id": -1,
    "AvailabilityQuest2": 0,
    "AvailabilityQuest2Id": -1,
    "AvailabilityQuestId": -1,
    "DialogQuest": -1,
    "DialogText": "There are three mods to look for in other modpacks:Metallurgy. This adds a crazy number of ores. It also creates new alloys. The worst one mixes iron and gold. DO NOT PUT BOTH IN A SMELTERY AT ONCE. You will be really annoyed. When Metallurgy is in play, I recommend rushing to The Nether. Use the tips from this quest book on getting there quickly. I mean you should be there when you only have stone tools! Once there, make a netherrack pick, then mine vyroxeres. This will start you on your way to getting stronger metals.Iguana Tweaks. This makes tools upgradeable but stretches out the toolmaking. You will need to make flint tools before mining stone. Usually this mod's recipe for turning gravel into flint in a crafting grid is on, so you just have to find some gravel. When making casts, usually whatever you used to make the cast gets destroyed. So make an ingot cast from a brick, not an iron ingot. Also, stick to the same tool and just upgrade it piecemeal by putting new parts for it in the upgrade tab of your tool station/forge.Tinkers' Steelworks. This adds a high furnace, which the mod uses to make steel. You need to create the body of the furnace using a smeltery. It will provide some books on what to do. It will also triple ore yields, so you will tend to use that furnace after it is completed. Fun fact: An early version of Baby's First Space Race used this mod for steel, but a bug caused it to eat people's metals, so it was removed. It's fixed now. I know older versions of Agrarian Sky use it.There are some interactions with other mods that you should also worry about.Thermal expansion. Do not try to smelt redstone to make destabilized redstone unless you use a fuel hotter than lava. It will only half-smelt, and you will be frustrated. You need to pay attention to the temperature in the recipe previews.Thermal smeltery. This lets you smelt in a magma crucible, using RF energy instead of lava and all the other Tinkers' Construct stuff.Big Reactors. Yellorium does not smelt evenly or efficiently. DO NOT SMELT YELLORIUM. Use an induction furnace instead, or pulverize it to dust and run it through a furnace. You will still double the yield.Mekanism. It has methods of increasing ore yields beyond just doubling them. It's fairly simple to set up 3x ore processing if you have started making the digital miner. In this pack, 3x ore processing is overkill, but not in other packs . . .",
    "AvailabilityQuest": 0,
    "AvailabilityFactionStance": 0,
    "DialogDisableEsc": 0b,
    "AvailabilityDayTime": 0,
    "AvailabilityFaction2": 0,
    "ModRev": 16,
    "AvailabilityDialog": 0,
    "DialogShowWheel": 0b,
    "DecreaseFaction2Points": 0b,
    "AvailabilityDialog2": 0,
    "AvailabilityFaction2Stance": 0,
    "Options": [
        {
            "OptionSlot": 0,
            "Option": {
                "DialogColor": 14737632,
                "DialogCommand": "",
                "Dialog": 18,
                "OptionType": 1,
                "Title": "Can you answer some other smelting questions?"
            }
        },
        {
            "OptionSlot": 1,
            "Option": {
                "DialogColor": 14737632,
                "DialogCommand": "",
                "Dialog": -1,
                "OptionType": 0,
                "Title": "Maybe I'll try those mods. Bye!"
            }
        }
    ],
    "OptionFaction2Points": 100,
    "AvailabilityQuest4Id": -1,
    "DialogHideNPC": 0b,
    "AvailabilityFaction": 0,
    "AvailabilityDialog2Id": -1,
    "DialogCommand": "",
    "AvailabilityDialog4": 0,
    "AvailabilityDialog3": 0,
    "DialogMail": {
        "Sender": "",
        "Time": 0L,
        "Message": {
        },
        "Subject": "",
        "MailItems": [
        ],
        "BeenRead": 0b,
        "MailQuest": -1,
        "TimePast": 1453185187169L
    },
    "OptionFactions1": -1,
    "AvailabilityDialogId": -1,
    "OptionFactions2": -1,
    "AvailabilityFaction2Id": -1,
    "OptionFaction1Points": 100,
    "DialogTitle": "Tips for other modpacks",
    "AvailabilityDialog3Id": -1,
    "AvailabilityDialog4Id": -1
}
