{
  "name": "A Post-Scarcity Economy",
  "description": "Various mods provide ways to generate and harvest wood in loops, or make pulling ore at the ground easy and automatic. They have different levels of sophistication with matching levels of requirements. You can explore some of them here. If you are on a team with a few beginners, you may consider making some of these and assigning them to keep an eye on the gear.",
  "quests": [
    {
      "name": "Infinite Cobblestone",
      "description": "Wait . . . MORE cobblestone? Well, there are plenty of ways to use it. You can turn them into gravel and sand, turn them into stone blocks, or plain-old stone. Or you might feed it into the progressive automation miner included in this section. You thought you were done with the stuff. Hahahaha! Use a transfer node to generate it. To make the node, use transfer pipes since they are cheap. Then place the cobblestone block between a block of water and a block of lava. Place the node on top. Give it the world interaction upgrade. It will start filling up with cobblestone. You can then direct it out of the transfer node into a chest.",
      "x": 19,
      "y": 70,
      "icon": {
        "id": "minecraft:cobblestone"
      },
      "prerequisites": [
        "{Vanilla Minecraft}[Iron Man]"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "items": [
            {
              "item": {
                "id": "ExtraUtilities:pipes"
              }
            },
            {
              "item": {
                "id": "ExtraUtilities:extractor_base"
              }
            },
            {
              "item": {
                "id": "ExtraUtilities:nodeUpgrade",
                "damage": 2
              }
            },
            {
              "item": {
                "id": "minecraft:chest"
              }
            },
            {
              "item": {
                "id": "minecraft:cobblestone"
              }
            },
            {
              "item": {
                "id": "minecraft:water_bucket"
              }
            },
            {
              "item": {
                "id": "minecraft:lava_bucket"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "MineFactoryReloaded:machine.1",
          "damage": 3
        },
        {
          "id": "minecraft:chest",
          "amount": 2
        }
      ]
    },
    {
      "name": "Minefactory Reloaded",
      "description": "There is a mod called \"Minefactory Reloaded.\" It handles general industrial material gathering. Of particular interest to us here is farming. With this set up, you can create a hands-free tree farm. If you hook up wood-fired generators to it, it becomes self-perpetuating. Isn\u0027t that creepy?!",
      "x": 96,
      "y": 13,
      "icon": {
        "id": "MineFactoryReloaded:rubber.raw"
      },
      "prerequisites": [
        "{Vanilla Minecraft}[Axe Me a Question]"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Getting Rubber",
          "longDescription": "To start things off, you have to pound on a rubber tree. You will have to look for them out in the wild. They generally have smooth bark. There are especially prolific in wet areas like swamps, but they\u0027ll be scattered all over. Find one and I\u0027ll give you a special surprise!",
          "items": [
            {
              "item": {
                "id": "MineFactoryReloaded:rubber.raw"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Plastic",
          "longDescription": "Smelt the rubber down twice and you will end up with plastic. This is an important ingredient for machines in Minefactory Reloaded.",
          "items": [
            {
              "item": {
                "id": "MineFactoryReloaded:plastic.raw"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "MineFactoryReloaded:rubberwood.sapling",
          "amount": 4
        }
      ]
    },
    {
      "name": "An Automated Farm",
      "description": "You will need a planter, a harvester, some power ducts, and some item ducts. Oh, and a power generator. Place the planter underneath the center of a 3x3 grid of dirt. Place the harvester facing the 3x3 patch just off to the middle of one side. Put seeds in the planter, and start hooking it all up. You can set up a basic loop this way. Seeds go back into the planter, perpetuating the process. I should note it doesn\u0027t need water near it; it will manage to dampen the soil on its own. I don\u0027t know how. Don\u0027t ask.",
      "x": 82,
      "y": 44,
      "icon": {
        "id": "MineFactoryReloaded:machine.0",
        "damage": 2
      },
      "prerequisites": [
        "Minefactory Reloaded"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "longDescription": "PS: The harvester\u0027s sludge will eventually slow the unit down unless you draw it off some how. Consider immediately making the sludge boiler, or at least piping the stuff off and ... I dunno, make a moat or something.",
          "items": [
            {
              "item": {
                "id": "MineFactoryReloaded:machine.0"
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "MineFactoryReloaded:machine.0",
                "damage": 2
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ThermalDynamics:ThermalDynamics_32",
          "damage": 1,
          "amount": 8
        },
        {
          "id": "ThermalDynamics:ThermalDynamics_0",
          "amount": 8
        },
        {
          "id": "MineFactoryReloaded:rubberwood.sapling",
          "damage": 2
        }
      ]
    },
    {
      "name": "Farming Monsters Muahaha",
      "description": "The grinder will automatically kill monsters in a 5x5 area in front of it and spit out all the stuff it got from taking them out. Monsters will spawn in any dark area a certain distance away from players. You will want to go over 16 blocks away from the dark recess where you place this just to be sure. Try it in a test area. Set it up inside an enclosure, with power (portable energy cell) and a chest, and come back in awhile. If there\u0027s monster stuff in it, you did it right!",
      "x": 131,
      "y": 14,
      "icon": {
        "id": "MineFactoryReloaded:machine.0",
        "damage": 13
      },
      "prerequisites": [
        "Minefactory Reloaded"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "items": [
            {
              "item": {
                "id": "MineFactoryReloaded:machine.0",
                "damage": 13
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ThermalDynamics:ThermalDynamics_0",
          "amount": 12
        }
      ]
    },
    {
      "name": "Progressive Automation",
      "description": "This is the poor man\u0027s post-scarcity economy. With these machines, you can start mining the ground underneath them with a steady supply of coal, cobblestone, and picks. You do have to tend to them, but the resources to make these machines is available earlier. Place it over the part of the ground you want to mine, and it will extract ores, replacing them with the cobblestone you give it. You can increase its range with upgrades.",
      "x": 89,
      "y": 89,
      "icon": {
        "id": "progressiveautomation:MinerStone"
      },
      "prerequisites": [
        "{Vanilla Minecraft}[Getting Stoned]",
        "Automated Mining"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Make The Wooden Miner",
          "longDescription": "Start with a wooden miner. It can only extract items that can be mined with a wooden pick, and you have to give it wooden picks. That doesn\u0027t leave much stuff to mine. So don\u0027t use it. However, you need it to make the stone miner. Note: you might have to fill in the recipe into a crafting board by hand; a lot of recipes won\u0027t autofill on the question mark symbol if they use Minecraft tools.",
          "items": [
            {
              "item": {
                "id": "progressiveautomation:Miner"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Make the Stone Miner",
          "longDescription": "The stone miner uses stone picks and can mine anything a stone pick can mine. We recommend using stone picks from Tinker\u0027s Construct since they\u0027re cheaper to repair. Stone can pick up quite a bit of stuff, so you might start using it right away before moving on to the iron miner in the next step.",
          "items": [
            {
              "item": {
                "id": "progressiveautomation:MinerStone"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "minecraft:iron_ingot",
          "amount": 8
        },
        {
          "id": "minecraft:redstone",
          "amount": 8
        },
        {
          "id": "minecraft:diamond"
        },
        {
          "id": "minecraft:coal_block",
          "amount": 8
        }
      ]
    },
    {
      "name": "The Iron Miner",
      "description": "An iron miner uses iron picks and can mine anything an iron pick can. You can use Tinker\u0027s Construct tools that are equivalent to iron in mining (bronze!). This can take care of most of your normal mining needs--especially after you start feeding it range upgrades!",
      "x": 52,
      "y": 135,
      "icon": {
        "id": "progressiveautomation:MinerIron"
      },
      "prerequisites": [
        "Progressive Automation",
        "{Vanilla Minecraft}[Iron Man]"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "items": [
            {
              "item": {
                "id": "progressiveautomation:MinerIron"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "minecraft:redstone",
          "amount": 8
        },
        {
          "id": "minecraft:iron_ingot",
          "amount": 8
        },
        {
          "id": "TConstruct:pickaxe",
          "nbt": "{InfiTool:{BaseDurability:714,Head:14,Built:1b,HarvestLevel:2,Attack:3,RenderHead:14,ModDurability:0.0f,Handle:14,Broken:0b,Shoddy:0.0f,RenderHandle:14,Accessory:14,MiningSpeed:800,RenderAccessory:14,Unbreaking:1,Damage:0,BonusDurability:0,Modifiers:3,TotalDurability:714},display:{Name:\"ï¿½fBronze Pickaxe\"}}"
        }
      ]
    },
    {
      "name": "Range Upgrades!",
      "description": "Each range upgrade increases the mining radius of the miner by 1. This accumulates very rapidly. You can throw a lot of upgrades at these things! If you want them back, bust down the miner with a pick, and they\u0027ll all fall out.",
      "x": 35,
      "y": 160,
      "icon": {
        "id": "progressiveautomation:IronUpgrade"
      },
      "prerequisites": [
        "The Iron Miner"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "items": [
            {
              "item": {
                "id": "progressiveautomation:IronUpgrade"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "progressiveautomation:IronUpgrade",
          "amount": 2
        }
      ]
    },
    {
      "name": "The Digital Miner!!!",
      "description": "Now we can start slinging everything together! You have to make the digital miner out of various other pieces you hopefully have. Remember that building this thing eats diamonds alive, but you will get all those diamonds back from using the machine for, oh, 20 seconds.",
      "x": 231,
      "y": 183,
      "icon": {
        "id": "Mekanism:MachineBlock",
        "damage": 4
      },
      "prerequisites": [
        "With Alloys Like These . . .",
        "Osmium Compressor"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "items": [
            {
              "item": {
                "id": "Mekanism:MachineBlock",
                "damage": 4,
                "nbt": "{energyMultiplier:0,speedMultiplier:0,electricity:0.0d}"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "Mekanism:Dust",
          "damage": 1,
          "amount": 8
        },
        {
          "id": "minecraft:diamond",
          "amount": 4
        },
        {
          "id": "OpenBlocks:flag"
        },
        {
          "id": "ThermalExpansion:Cell",
          "damage": 3,
          "nbt": "{Recv:8000,RSControl:1b,Facing:3b,Energy:0,SideCache:[0:\"6 bytes\"],Send:8000}"
        }
      ]
    },
    {
      "name": "I Crush Your Ores!",
      "description": "The crusher can be used to grind ores into dust as part of an ore processing rig, but your smeltery doesn\u0027t normally care. However, you do need it to crush some of the diamonds for the digital miner. You will want to follow the digital miner recipe through to figure out exactly how much diamond dust to produce. It also makes noises that will make your base sound like a Nine Inch Nails song. Note: You may have already completed this quest in the electrical power section. Good for you!",
      "x": 230,
      "y": 142,
      "icon": {
        "id": "Mekanism:MachineBlock",
        "damage": 3
      },
      "prerequisites": [
        "Bread and Circuits"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "longDescription": "Since the crusher requires lava buckets, it probably won\u0027t autofill in a crafting table if you click on the question mark icon for the crusher. You will have to put all the pieces on the crafting table yourself.",
          "items": [
            {
              "item": {
                "id": "Mekanism:MachineBlock",
                "damage": 3,
                "nbt": "{energyMultiplier:0,speedMultiplier:0,electricity:0.0d}"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "minecraft:diamond"
        },
        {
          "id": "Mekanism:SpeedUpgrade"
        }
      ]
    },
    {
      "name": "Intro To The Digital Miner",
      "description": "The digital miner is God\u0027s gift to automated mining. It will zap out ores in the surrounding ground with a range you give it, for ores you can optionally specify. It can do it without breaking the ores, giving you a chance to multiply your diamond yield. It can be upgraded to mine very quickly and efficiently. It also ... costs something like 14 diamonds. You will want to set up multiple crafting tables from Tinker\u0027s Construct to hold the intermediate steps while making it, if you chose to even try.",
      "x": 229,
      "y": 88,
      "icon": {
        "id": "Mekanism:MachineBlock",
        "damage": 8
      },
      "prerequisites": [
        "{Vanilla Minecraft}[Iron Man]",
        "Automated Mining"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Metallurgic Infuser",
          "longDescription": "The metallurgic infuser produces all the crazy alloys you need to make the digital miner. You will need a lot of these special alloys, so consider building more than one. Hey, I\u0027ll throw in one for you if you build the first one!",
          "items": [
            {
              "item": {
                "id": "Mekanism:MachineBlock",
                "damage": 8,
                "nbt": "{energyMultiplier:0,speedMultiplier:0,electricity:0.0d}"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "Mekanism:MachineBlock",
          "damage": 8
        }
      ]
    },
    {
      "name": "With Alloys Like These . . .",
      "description": "This is an alloy made of an alloy of another alloy. It also needs pulverized diamonds! You want to look through all the components you need for the digital miner and count out how many of these you need. Hey! Where are you going? At least I\u0027ll give you a second one if you make one yourself first.",
      "x": 275,
      "y": 146,
      "icon": {
        "id": "Mekanism:AtomicAlloy"
      },
      "prerequisites": [
        "Baby\u0027s First Alloy",
        "I Crush Your Ores!"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Enriching Experience",
          "longDescription": "You will need the enrichment machine to turn obsidian into dirty obsidian dust.",
          "items": [
            {
              "item": {
                "id": "Mekanism:MachineBlock",
                "nbt": "{electricity:0.0d,upgrades:[]}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Intermediate Alloy",
          "longDescription": "Make sure you have a basic enriched alloy. Then crush another diamond and feed it into the metallurgic infuser. Feed in the enriched alloy to get a reinforced alloy.",
          "items": [
            {
              "item": {
                "id": "Mekanism:ReinforcedAlloy"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "The Big Day",
          "longDescription": "Feed one refined obsidian dust into the metallurgic infuser, and then give it the reinforced alloy. This will make you one atomic alloy. You will have to do this quite a few times to make the final digital miner, so get your diamonds and obsidian ready!",
          "items": [
            {
              "item": {
                "id": "Mekanism:AtomicAlloy"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "Mekanism:AtomicAlloy"
        },
        {
          "id": "Mekanism:SpeedUpgrade",
          "amount": 2
        }
      ]
    },
    {
      "name": "Baby\u0027s First Alloy",
      "description": "This basic alloy is a bulwark of Mekanism equipment. You will make MANY of these along the path towards the digital miner. You combine redstone dust and iron ingots in the metallurgic infuser, and listen to in whine, buzz, and fuzz as it makes them. Feel free to raise the volume and annoy your neighbors.",
      "x": 278,
      "y": 114,
      "icon": {
        "id": "Mekanism:EnrichedAlloy"
      },
      "prerequisites": [
        "Intro To The Digital Miner"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "items": [
            {
              "item": {
                "id": "Mekanism:EnrichedAlloy"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "Mekanism:EnrichedAlloy",
          "amount": 3
        }
      ]
    },
    {
      "name": "Upgrades!",
      "description": "You can make that digital miner run faster and more efficiently. Try the speed and efficiency upgrades. You give me one of each, and I\u0027ll spot you a pair myself.",
      "x": 276,
      "y": 181,
      "icon": {
        "id": "Mekanism:SpeedUpgrade"
      },
      "prerequisites": [
        "The Digital Miner!!!"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "items": [
            {
              "item": {
                "id": "Mekanism:SpeedUpgrade"
              }
            },
            {
              "item": {
                "id": "Mekanism:EnergyUpgrade"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "Mekanism:SpeedUpgrade"
        },
        {
          "id": "Mekanism:EnergyUpgrade"
        }
      ]
    },
    {
      "name": "Osmium Compressor",
      "description": "Here\u0027s Another Machine to make goofy sounds. Along the way of making the digital miner, you will have to create some compressed obsidian. So you will need this stupid machine. It sounds like it\u0027s squeezing the crap out of whatever you put inside, because that\u0027s what it\u0027s actually doing.",
      "x": 197,
      "y": 160,
      "icon": {
        "id": "Mekanism:MachineBlock",
        "damage": 1
      },
      "prerequisites": [
        "Bread and Circuits"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Make The Machine",
          "items": [
            {
              "item": {
                "id": "Mekanism:MachineBlock",
                "damage": 1
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "A Refined Palate",
          "longDescription": "This is kind of dumb. You will have to run some crushed obsidian through the metallurgic infuser with some diamond dust to get refined diamond dust. You then place an osmium ingot in the bottom of the compressor GUI, and that refined dust in the top. It will then play some creepy, torture sounds and squirt out the ingot you need.",
          "items": [
            {
              "item": {
                "id": "Mekanism:Ingot"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "Mekanism:Ingot"
        },
        {
          "id": "minecraft:diamond"
        },
        {
          "id": "Mekanism:SpeedUpgrade"
        }
      ]
    },
    {
      "name": "Bread and Circuits",
      "description": "The digital miner (and other equipment) needs circuit boards! Run some osmium and redstone through your metallurgic infuser to make some!",
      "x": 196,
      "y": 111,
      "icon": {
        "id": "Mekanism:ControlCircuit"
      },
      "prerequisites": [
        "Intro To The Digital Miner"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "items": [
            {
              "item": {
                "id": "Mekanism:ControlCircuit"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "Mekanism:ControlCircuit",
          "amount": 3
        }
      ]
    },
    {
      "name": "The Sludge Boiler",
      "description": "You may notice sludge storing up in the harvester. That can stay there indefinitely, but the harvester will slow down. You could also run it to this thing with some fluiduct and power. You will want to do this well away from everything else because it\u0027s operation is toxic! It will give you poison and nausea. For your trouble, you will get all kinds of sand, dirt, nether stuff, clay, and other bizarre things you sometimes need. That\u0027s useless in this pack, but it\u0027s a godsend in resource-scarce packs.",
      "x": 112,
      "y": 45,
      "icon": {
        "id": "MineFactoryReloaded:machine.0",
        "damage": 9
      },
      "prerequisites": [
        "An Automated Farm"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "items": [
            {
              "item": {
                "id": "MineFactoryReloaded:machine.0",
                "damage": 9
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ThermalDynamics:ThermalDynamics_0",
          "amount": 8
        },
        {
          "id": "ThermalDynamics:ThermalDynamics_16",
          "amount": 8
        }
      ]
    },
    {
      "name": "Semi-Automatic Farming",
      "description": "Since you\u0027re getting cozy with the miner, we might as well talk a little more about the planter. This is a semi-automatic farmer. That is, you have to feed it wooden hoes and fuel. Well, and seeds too, but then it will take care of planting them above the unit and harvesting them. In case you missed that, you want to put this BELOW the area you are farming.",
      "x": 52,
      "y": 99,
      "icon": {
        "id": "progressiveautomation:Planter"
      },
      "prerequisites": [
        "Progressive Automation"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "items": [
            {
              "item": {
                "id": "progressiveautomation:Planter"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "progressiveautomation:WoodUpgrade",
          "amount": 3
        },
        {
          "id": "minecraft:wooden_hoe"
        },
        {
          "id": "minecraft:coal_block",
          "amount": 4
        }
      ]
    },
    {
      "name": "Get Back To The Chopper!",
      "description": "You may find you need a lot of wood. The chopper is a semi-auto wood farming machine. You feed it fuel, axes, and saplings. It will then plant saplings in front of it, and chop down the trees that grow from them.",
      "x": 76,
      "y": 135,
      "icon": {
        "id": "progressiveautomation:Chopper"
      },
      "prerequisites": [
        "Progressive Automation"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "longDescription": "Remember that you might have to manually place all the ingredients in the crafting table since it requires a vanilla Minecraft axe. A lot of recipes screw up with that if you try to use the question mark box to autofill them in.",
          "items": [
            {
              "item": {
                "id": "progressiveautomation:Chopper"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "progressiveautomation:WoodUpgrade",
          "amount": 3
        }
      ]
    },
    {
      "name": "Yes We Watering Can!",
      "description": "If you are starving to death right now, and you have some wood, bonemeal, and iron, make a watering can. Right click it on nearby water, which will permanently fill it. You can then spray water all over your crops to grow them faster. Just stand there with the thing and watch them shoot right up.",
      "x": 20,
      "y": 14,
      "icon": {
        "id": "ExtraUtilities:watering_can"
      },
      "prerequisites": [
        "{Vanilla Minecraft}[Iron Man]"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "longDescription": "This will trigger when the watering can has been made and filled.",
          "items": [
            {
              "item": {
                "id": "ExtraUtilities:watering_can"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "MineFactoryReloaded:farmland",
          "amount": 6
        }
      ]
    },
    {
      "name": "Water Ordinance Violation",
      "description": "For lazy crop speed-up, use a sprinkler. You will need to feed it water. We recommend an aqueous accumulator in a pool of water, with some fluiduct running from it to the sprinkler. The sprinkler will spray water in a 7x7 area, speeding up growth of all plants around it.",
      "x": 45,
      "y": 33,
      "icon": {
        "id": "OpenBlocks:sprinkler"
      },
      "prerequisites": [
        "Yes We Watering Can!"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "longDescription": "The \"Hoarding and Logistics\" chapter has a quest involving making fluiducts already.",
          "items": [
            {
              "item": {
                "id": "ThermalExpansion:Machine",
                "damage": 8,
                "nbt": "{RSControl:0b,Facing:5b,Energy:0,SideCache:[0:\"6 bytes\"],Level:0b,Augments:[0:{Slot:0,id:4370s,Count:1b,Damage:0s},1:{Slot:1,id:4370s,Count:1b,Damage:32s},2:{Slot:2,id:4370s,Count:1b,Damage:16s}]}"
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "OpenBlocks:sprinkler"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "xreliquary:lilypad"
        },
        {
          "id": "minecraft:dye",
          "damage": 15,
          "amount": 4
        }
      ]
    },
    {
      "name": "Range Upgrades",
      "description": "The planter/harvesters work in a 3x3 area by default. If you want to work a larger area, you don\u0027t necessarily have to build more of them. You can upgrade the range of existing ones. Note that each tier of upgrade increases the RADIUS. This means this measly lapis upgrade we want which has a +1 radius upgrade to it increases your farm to a 5x5. You may be tempted to make the biggest one you got, but range upgrades don\u0027t accelerate the machines\u0027 own abilities to detect changes in their area. Once you get a farm that is accelerating plant growth, this becomes a problem. So a 6x6 is often the biggest you\u0027d want to go. Otherwise, you\u0027re waiting on the harvester to detect a crop or tree when it is busy scanning quiet parts of the plot.",
      "x": 59,
      "y": 68,
      "icon": {
        "id": "MineFactoryReloaded:upgrade.radius"
      },
      "prerequisites": [
        "An Automated Farm"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "longDescription": "You will need a upgrade in your planter and harvester. You will have to shuffle them around after you increase their radius; move the harvester back one space per radius increase given in the upgrade. Also note that some machines like the grinder can\u0027t take upgrades.",
          "items": [
            {
              "item": {
                "id": "MineFactoryReloaded:upgrade.radius",
                "damage": 2
              },
              "required": 2
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "MineFactoryReloaded:machine.0",
          "damage": 12
        }
      ]
    },
    {
      "name": "Ender-Thermic Pump",
      "description": "I wanted to put in a few words for the ender-thermic pump. You have to build two of these to make the quarry, but it\u0027s a first-class machine of its own. You can use one of these to pump out a fluid below it into tanks. Take this to The Nether and you will not be short of lava. It will also pump if you go offline from a server, or walk away from it. It replaces liquid with blocks, which reduces lag from fluid issues. In packs with alternate dimensions of molten metal seas (this is a thing!), this is a handy machine.",
      "x": 133,
      "y": 135,
      "icon": {
        "id": "ExtraUtilities:enderThermicPump"
      },
      "prerequisites": [
        "Intro To The Ender Quarry",
        "A Use For Magic Books"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Make One, Win One",
          "longDescription": "If you make one, I\u0027ll give you the second for free. I\u0027d suggest making a third one for your own schemes.",
          "items": [
            {
              "item": {
                "id": "ExtraUtilities:enderThermicPump"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ExtraUtilities:enderThermicPump"
        },
        {
          "id": "minecraft:diamond",
          "amount": 4
        }
      ]
    },
    {
      "name": "Intro To The Ender Quarry",
      "description": "My personal preference for automated mining is the digital miner, but you may upgrade to a full-tech pack that does not have Mekanism. Alternately, you find the progression for making that machine too tedious. Enter the ender quarry. This machine requires some exotic ingredients: enchanted books, obsidian, diamonds, blaze powder, and some ender pearls. However, if you play your cards right, you can get all this stuff far earlier than you would get the stuff for a digital miner. The ender quarry strip mines a fenced region, but does it in a server-friendly way. It also will continue to mine even if you walk away or log off. So you can set this critter going on a server overnight, and find piles of stuff available the next day.",
      "x": 131,
      "y": 97,
      "icon": {
        "id": "ExtraUtilities:decorativeBlock1",
        "damage": 1
      },
      "prerequisites": [
        "Automated Mining"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Checking For The Basics",
          "longDescription": "I won\u0027t let you past until you\u0027ve gotten some of the basics under way. You don\u0027t need this all right away, but you will soon!",
          "items": [
            {
              "item": {
                "id": "minecraft:ender_pearl"
              },
              "required": 4
            },
            {
              "item": {
                "id": "minecraft:blaze_powder"
              },
              "required": 2
            },
            {
              "item": {
                "id": "minecraft:obsidian"
              },
              "required": 4
            },
            {
              "item": {
                "id": "minecraft:diamond"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Ender Infusion",
          "longDescription": "Get used to ender-infused obsidian. You will be using quite a few blocks of them in the crafting ingredients before you finish the quarry.",
          "items": [
            {
              "item": {
                "id": "ExtraUtilities:decorativeBlock1",
                "damage": 1
              },
              "required": 4
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "minecraft:blaze_powder",
          "amount": 2
        },
        {
          "id": "minecraft:ender_pearl",
          "amount": 4
        },
        {
          "id": "minecraft:obsidian",
          "amount": 12
        }
      ]
    },
    {
      "name": "A Use For Magic Books",
      "description": "The ender quarry requires magical wood. This is by far the strangest ingredient in the hole process. If you look at the recipe, you will see it requires magical books. You can make one by crafting together a regular book with an emerald. However, any normal enchanted book will do. At this point, you probably have built up your mining levels, so you can blow them on enchanting some books the old-fashioned way. That\u0027s cheaper than emeralds!",
      "x": 161,
      "y": 145,
      "icon": {
        "id": "ExtraUtilities:decorativeBlock1",
        "damage": 8
      },
      "prerequisites": [
        "{Vanilla Minecraft}[Diamonds!]"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Base Ingredients",
          "longDescription": "Time to make a vanilla enchantment table, and some books. Fun fact: You can make books using Tinkers Construct blank patterns for book covers. You don\u0027t need to use leather.",
          "items": [
            {
              "item": {
                "id": "minecraft:enchanting_table"
              }
            },
            {
              "item": {
                "id": "minecraft:book"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Crafting the Wood",
          "longDescription": "I can\u0027t test for the enchanted books, so I\u0027m going to assume you\u0027ll figure it out. Use the cheapest enchantment for each book. This should string out the cost. If you were at level 30, you should be able to enchant all the books you need.",
          "items": [
            {
              "item": {
                "id": "ExtraUtilities:decorativeBlock1",
                "damage": 8
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ExtraUtilities:decorativeBlock1",
          "damage": 8,
          "amount": 4
        }
      ]
    },
    {
      "name": "A Holesome Experience",
      "description": "The world hole upgrade will leave the hole behind for you. You will want to do this if you intend to inhabit the space the quarry is carving out for you. The sad thing is that the process for making this upgrade is just about as complicated as making the quarry itself. You need to build a QED machine and power it from a special crystal. We\u0027ll go through it.",
      "x": 101,
      "y": 184,
      "icon": {
        "id": "ExtraUtilities:enderQuarryUpgrade",
        "damage": 1
      },
      "prerequisites": [
        "Finding Your Quarry"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "QED",
          "longDescription": "It\u0027s the \"Quantum Ender Device.\"",
          "items": [
            {
              "item": {
                "id": "ExtraUtilities:endConstructor"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Crystal Power",
          "longDescription": "This is the really bizarre part. You will have to feed this some power from your power generation, but have it near the QED. It will then power the QED.",
          "items": [
            {
              "item": {
                "id": "ExtraUtilities:endConstructor",
                "damage": 2
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Finally, The Upgrade",
          "longDescription": "The recipe you see for the world hole upgrade must be fed into the QED machine. Then it will start to churn on it. Place the upgrade adjacent to the quarry, but not along the fence perimeter, and not inside the quarry\u0027s operating area. That leaves you with above, below, or behind.",
          "items": [
            {
              "item": {
                "id": "ExtraUtilities:enderQuarryUpgrade",
                "damage": 1
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ExtraUtilities:enderQuarryUpgrade",
          "damage": 8
        },
        {
          "id": "minecraft:ender_pearl",
          "amount": 4
        },
        {
          "id": "minecraft:diamond",
          "amount": 4
        }
      ]
    },
    {
      "name": "Finding Your Quarry",
      "description": "Well, it\u0027s time to build the quarry. Note that this quarry will replace whatever it mines with dirt. Hang around for the next quest if you want holes. Why would you want holes? Perhaps you want to carve out a space for a big base!",
      "x": 131,
      "y": 170,
      "icon": {
        "id": "ExtraUtilities:enderQuarry"
      },
      "prerequisites": [
        "Ender-Thermic Pump"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "longDescription": "Here\u0027s how it works. Enclose an area in fence. Punch a hole out of it. Place the quarry there. Supply it power. Put a chest somewhere next to it but not within the mining area. Have itemducts pump out from that to bigger storage. Make sure the area up to 5 blocks above it is clear; it will mine there too! If you were setting up power generation above that hole in that area, it will mine your machines! Whoops! Once powered, it should start chomping away. Right-clicking it should tell you if it\u0027s doing something, or if it\u0027s angry.",
          "items": [
            {
              "item": {
                "id": "ExtraUtilities:enderQuarry"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "minecraft:ender_pearl",
          "amount": 8
        },
        {
          "id": "minecraft:diamond",
          "amount": 4
        }
      ]
    },
    {
      "name": "Drill, Baby, Drill!",
      "description": "Ahhh, the laser drill. This is a fun toy. It just takes a TON of RF power to run it! You need one mining laser, and at least one laser precharger for it. Only prechargers can drive it. You arrange one precharger on each side, with one space in between. You power the precharger, and it will charge the drill. You\u0027ll need to double check the prechargers are pointing the right way. Each precharger consumes 5,000 RF per tick to operate. The basic Big Reactor will almost power one. You\u0027ll need to do better to run a full four prechargers. For your effort, you get something that vomits random ore all day and night, forever.",
      "x": 205,
      "y": 14,
      "icon": {
        "id": "MineFactoryReloaded:machine.2"
      },
      "prerequisites": [
        "{Electrical Power}[The Power Of The Atom]",
        "{Electrical Power}[An Electrum Personality]",
        "Finding Laughter In Slaughter"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "The Drill",
          "longDescription": "You might think it\u0027s bad to making the laser drill itself. Wait until you make the prechargers! Just remember: IT WILL PAY FOR ITSELF. Oh and also... you have to give it a clear path straight to the bedrock. Important detail. You need a hole going straight down. I recommend doing that incrementally so you don\u0027t fall into some death hole somewhere.",
          "items": [
            {
              "item": {
                "id": "MineFactoryReloaded:machine.2"
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Pink crystals?!",
          "longDescription": "The laser drill precharger needs a pink slime crystal. You get that from pink slimes. You get pink slimes from running... animals through slaughterhouse. Yeah, this ain\u0027t no rodeo. Actually, given the cows involved, it kind of is...",
          "items": [
            {
              "item": {
                "id": "MineFactoryReloaded:pinkslime",
                "damage": 1
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Getting Charged",
          "longDescription": "Great, now you can dish out a precharger. Point this one space away from your laser drill and give it power. Get some kind of item duct on top of the drill, and have that import into whatever storage you have. It will fill up with ore every few seconds. More prechargers makes it faster. Just one is ... really slow, actually. It\u0027s still making something from nothing.",
          "items": [
            {
              "item": {
                "id": "MineFactoryReloaded:machine.2",
                "damage": 1
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "MineFactoryReloaded:machine.2",
          "damage": 1
        },
        {
          "id": "ThermalExpansion:Cell",
          "damage": 4,
          "nbt": "{Recv:32000,RSControl:1b,Facing:3b,Energy:80000000,SideCache:[0:\"6 bytes\"],Send:32000}"
        }
      ]
    },
    {
      "name": "Finding Laughter In Slaughter",
      "description": "You can run animals through a grinder to get the normal stuff out of them, but a slaughterhouse will be useful to turn your animals into... basically, Spam. That sounds like a terrible idea, but you need some pink slime to make mining laser prechargers, and that is serious business.",
      "x": 172,
      "y": 14,
      "icon": {
        "id": "MineFactoryReloaded:machine.1",
        "damage": 13
      },
      "prerequisites": [
        "Farming Monsters Muahaha"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Invar?! Why??",
          "longDescription": "Honestly, it takes a stupid amount of invar. I think they just don\u0027t want people to make a beeline to the mining laser and get to post-scarcity in, like, 20 minutes or something. Fine.",
          "items": [
            {
              "item": {
                "id": "MineFactoryReloaded:machine.1",
                "damage": 13
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ThermalFoundation:material",
          "damage": 72,
          "amount": 10
        }
      ]
    },
    {
      "name": "The Battle Of Cowpens",
      "description": "Making an automated cattle operation requires getting the things to make babies for you. Actually, this whole thing is kind of strange, I am telling you right now. The breeder is a simple addition. You feed it power and whatever the animals you\u0027re trying to breed like, and it will do the rest. Note: you need to keep an eye on this or you might get a runaway scenario with a tiny pen crammed full of animals.",
      "x": 149,
      "y": 49,
      "icon": {
        "id": "MineFactoryReloaded:machine.0",
        "damage": 12
      },
      "prerequisites": [
        "Finding Laughter In Slaughter"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Making Babies",
          "longDescription": "When using this machine, you probably want to extend your fence up and around it, because animals can get up on top of it and escape their pen. I like to run items into it from the back, and power it it from underneath. Making this thing is also kind of rough. You need golden carrots and a golden apple. Oddly enough, the hard part might be the purple dye! Go on a hunt for some red flowers.",
          "items": [
            {
              "item": {
                "id": "MineFactoryReloaded:machine.0",
                "damage": 12
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "minecraft:red_flower",
          "damage": 4,
          "amount": 8
        },
        {
          "id": "minecraft:gold_ingot",
          "amount": 2
        }
      ]
    },
    {
      "name": "Swabbing The Poop Deck",
      "description": "Hey, while you have animals running around in a confined space, you might as well think about their butt situation. Hehehe, butts. They poop, you know, right? Set up a sewer in the middle of the pen and it will fill up with sewage. Actually, any XP orbs nearby will get sucked up in it too. Be ready for that and filter that off to someplace else like a mob farm! Alternately, a fluid trash can...",
      "x": 175,
      "y": 54,
      "icon": {
        "id": "MineFactoryReloaded:fertilizer"
      },
      "prerequisites": [
        "Finding Laughter In Slaughter"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Your Mind\u0027s In The Gutter",
          "longDescription": "Sewers are pretty easy to make. After all this fuss with other MFR machines, this should be a breeze! You replace part of the floor of your farm with these, and the monsters will just... deposit in them. Heck, you can walk on top of one, hit the shift key to squat, and... it fills up with a little sewage. I\u0027m not making this up!",
          "items": [
            {
              "item": {
                "id": "MineFactoryReloaded:machine.0",
                "damage": 10
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Composting An Essay",
          "longDescription": "You need a composter to turn that poo muck into fertilizer.",
          "items": [
            {
              "item": {
                "id": "MineFactoryReloaded:machine.0",
                "damage": 11
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Poo Power",
          "longDescription": "There\u0027s an alternate recipe for this you can make by combining lots of stuff together, but I\u0027d rather hope you make it by combining lots of literal crap together. That\u0027s the honorable way. Use the composter.",
          "items": [
            {
              "item": {
                "id": "MineFactoryReloaded:fertilizer"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "ExtraUtilities:trashcan",
          "damage": 1
        },
        {
          "id": "Mekanism:MachineBlock2",
          "damage": 11,
          "amount": 2
        },
        {
          "id": "ThermalDynamics:filter",
          "amount": 2
        },
        {
          "id": "MineFactoryReloaded:bucket.sewage"
        }
      ]
    },
    {
      "name": "Going All The Way",
      "description": "The final tier to the Progressive Automation miner is the diamond tier. It can mine all overworld materials--if given appropriate tools. For all this effort, it is still semi-automated. We can actually change that! There is a special wrench that lets you assign different sides to input or output things. We can use this to pump in tools, fuel, and cobblestone; and pump out harvested materials. The issue of connecting the machines is a topic in the Hoarding and Logistics chapter.",
      "x": 21,
      "y": 187,
      "icon": {
        "id": "progressiveautomation:MinerDiamond"
      },
      "prerequisites": [
        "Range Upgrades!",
        "Infinite Cobblestone"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "A Progressive Wrench",
          "longDescription": "Progressive Automation has... another type of wrench. Seriously? All the mods seem to make their own wrench. This one behaves a little bit differently. You shift-right-click it to toggle its mode. The ones we care about are: Input, FuelInput, and Output. You use the Input to set two sides for cobblestone collection and tool importing. For full automation, use tools created from a crafting bench, not Tinkers\u0027 Construct tools. This way, when they break, a new one comes running in. I recommend Bloodwood. Set another side to FuelInput, and send in your wood or charcoal or whatever through that side. Finally, set one side to output and extract the mined goods out of it. With this setup, you can walk away from the miner.",
          "items": []
        },
        {
          "type": "CRAFT",
          "description": "That\u0027s An Expensive Miner",
          "longDescription": "If you want to mine the high-tier stuff, you need a diamond miner with diamond-level tools (hint, Bloodwood). You can use your iron miner as an ingredient here. The diamond miner is also pretty fast.",
          "items": [
            {
              "item": {
                "id": "progressiveautomation:MinerDiamond"
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Getting Engaged To A Miner",
          "longDescription": "Only the best for our diamond miner. If you\u0027re going through all this trouble, you might as well increase the range from a weak one to something else. Remember that the number of blocks you mine grows non-linearly for each upgrade. So a range 1 miner only does 1 column. A range 2 does 9. A range 3 does 16. A range 4 does 27. If you want to keep your miner off the streets, you will want to improve its range.",
          "items": [
            {
              "item": {
                "id": "progressiveautomation:DiamondUpgrade"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "progressiveautomation:DiamondUpgrade",
          "amount": 2
        }
      ]
    },
    {
      "name": "Automated Mining",
      "description": "For a game called \"Minecraft,\" you\u0027d think people liked mining. Well, not so much with technical mods. There are all kinds of ways to automatically mine. I am presenting here three of them. First, there is Progressive Automation. This gets you an automated miner the quickest, but it is not as advanced as the other miners. I recommend making this one before replacing it with a more advanced one. This way, you can potentially play the whole game without going in a cave. The second miner is the ender quarry. This one can run unattended since it comes with its own chunk loader. You may have discovered machines stop working when you walk far away from them. Not this guy! It also can mine very large ranges. However, the ingredients for it are very exotic. Very. Finally, there is the digital miner. This one gives you the most control and flexibility, and is my personal preference. However, you have to set up all kinds of intermediate tools and machines to even make it, and then you have to upgrade it to make it shine. I recommend ultimately making all of them. When you play another pack, one or more of these miners may not be available. Knowing how to use them all becomes very useful.",
      "x": 117,
      "y": 73,
      "icon": {
        "id": "TConstruct:pickaxe",
        "nbt": "{InfiTool:{BaseDurability:97,Head:316,BaseAttack:1,Built:1b,HarvestLevel:1,Attack:1,RenderHead:316,ModDurability:0.0f,Handle:316,Broken:0b,Shoddy:0.0f,RenderHandle:316,Accessory:316,MiningSpeed:150,RenderAccessory:316,Unbreaking:0,Damage:0,BonusDurability:0,TotalDurability:97,Modifiers:11},display:{Name:\"§fMagical Wooden Pickaxe\"}}"
      },
      "prerequisites": [
        "{Vanilla Minecraft}[*MINE*craft]"
      ]
    },
    {
      "name": "The Engine That Could",
      "description": "Hey, maybe shoving wood into your miner is getting annoying. You might have RF power at this point. If you do, try this engine upgrade. It will power the engine on RF power. However, you\u0027ll have to keep it powered!",
      "x": 57,
      "y": 185,
      "icon": {
        "id": "progressiveautomation:RFEngine",
        "nbt": "{charge:0}"
      },
      "prerequisites": [
        "Going All The Way"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "I Think I Can",
          "longDescription": "Actually, this is pretty easy to make. Why did I wait so long to highlight it? People are usually using this miner very early in their game, and they don\u0027t even necessarily have RF power setup yet.",
          "items": [
            {
              "item": {
                "id": "progressiveautomation:RFEngine"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "minecraft:redstone_block"
        }
      ]
    }
  ],
  "reputationBar": []
}